# First print your name in the cell below then save this file. (or something nice about your instructor)

In [20]:
# In this cell print your name 
print("Claudio Perinuzzi")

Claudio Perinuzzi

# Data wrangling with Pandas exercise
* For this exercise we will be using the `listings.csv` data file.

In [21]:
import pandas as pd
import numpy as np

# Load in the data file using `pd.read_csv()`

In [22]:
# Load data here
df = pd.read_csv("data/listings.csv")

## Exercise 2 - Filtering

Return the following subsets of the dataframe.

1. How many listings are there with a price less than 100? 


2. Find how many listings there are in just Brooklyn.


3. Find how many listings there are in Brooklyn with a price less than 100.


4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.


5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  The prices for all other listings should be the same as the were before. 


6. What % of the rooms are private, and what % of the rooms are shared.  
    * Hint, use `.value_counts()`

In [23]:
# 1. How many listings are there with a price less than 100? 
condition = df['price'] < 100
num_listings = len(df[condition])
print(f"There are {num_listings} number of listings in Brooklyn with a price less than 100")

There are 22778 number of listings in Brooklyn with a price less than 100

In [24]:
# 2. Make a new DataFrame of listings in Brooklyn named `df_bk` 
# and find how many listings in just Brooklyn.
condition = df['neighbourhood_group'] == 'Brooklyn'
df_bk = df[condition]
df_bk.neighbourhood_group.value_counts()

neighbourhood_group
Brooklyn    18632
Name: count, dtype: int64

In [25]:
# 3. Find how many listings there are in Brooklyn with a price less than 100.
df_bk_cheap = df_bk['price'] < 100
df_bk_cheap.value_counts().get(True)

# or by creating another df
condition = df_bk['price'] < 100
df_bk_cheap = df_bk[condition]
df_bk_cheap.price.count()

10473

In [26]:
# 4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.
# How many total are there that have those names
host_names = ["Michael", "David", "John", "Daniel"]
condition = df['host_name'].isin(host_names)
host_df = df[condition]
# host_df.host_name.value_counts()

total = host_df.host_name.count()
print("total is", total)

total is 1258

In [27]:
# 5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  
# The prices for all other listings should be the same as the were before. 
condition = df['neighbourhood'] == 'Williamsburg'
df['adjusted_price'] = np.where(condition, df['price'] + 100, df['price'])

cols = ['price', 'neighbourhood', 'adjusted_price']
df[cols].head(25)

    price       neighbourhood  adjusted_price
0     175             Midtown             175
1      75        Clinton Hill              75
2      60  Bedford-Stuyvesant              60
3     175         Sunset Park             175
4      65      Hell's Kitchen              65
5      75     Upper West Side              75
6     140           Chinatown             140
7     160        West Village             160
8      88         South Slope              88
9      85     Upper West Side              85
10     65        West Village              65
11    109        Williamsburg             209
12    239         East Harlem             239
13    182         Fort Greene             182
14     96         East Harlem              96
15    299        Williamsburg             399
16    120  Bedford-Stuyvesant             120
17    135     Windsor Terrace             135
18     86              Inwood              86
19    220        East Village             220
20     55              Harlem              55
21     70  Bedford-Stuyvesant              70
22     88         South Slope              88
23    150            Flatbush             150
24     40     Lower East Side              40

In [28]:
# 6. What % of the rooms are private, and what % of the rooms are shared.  
df_room = df.room_type.value_counts(normalize=True)
private_room_percent = df_room['Private room'] * 100
non_private_room_percent = 100 - private_room_percent

print(f"private percentage = {private_room_percent:.2f}")
print(f"non-private percentage = {non_private_room_percent:.2f}")

private percentage = 45.44
non-private percentage = 54.56

# Exercise 3 - Grouping

1. Using `groupby`, count how many listings are in each neighbourhood_group.


2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 


4. Using `groupby`, find the median price for each room type in each neighbourhood_group.


5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices for each room type in each neighbourhood_group.

In [29]:
# 1. Using `groupby`, count how many listings are in each neighbourhood_group.

gb = df.groupby('neighbourhood_group')
gb['neighbourhood_group'].count()

neighbourhood_group
Bronx             1183
Brooklyn         18632
Manhattan        20580
Queens            5791
Staten Island      341
Name: neighbourhood_group, dtype: int64

In [30]:
# 2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 
gb = df.groupby('neighbourhood_group')
gb['price'].mean()

neighbourhood_group
Bronx             92.751479
Brooklyn         120.225258
Manhattan        191.880466
Queens            99.754965
Staten Island    110.947214
Name: price, dtype: float64

In [31]:
# 2.5. Using `groupby`, find the mean price for each room_type. 
gb = df.groupby('room_type')
gb['price'].mean()

room_type
Entire home/apt    199.395950
Hotel room         275.015075
Private room        91.453084
Shared room         87.063830
Name: price, dtype: float64

In [32]:
# 3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 
gb = df.groupby('neighbourhood_group')
gb['price'].agg(['min', 'max'])

                     min    max
neighbourhood_group
Bronx                 16   1404
Brooklyn               0  10000
Manhattan              0  10000
Queens                 0  10000
Staten Island         19   1200

In [33]:
# 4. Using `groupby`, find the mean price for each room_type in each neighbourhood_group.
gb = df.groupby(['neighbourhood_group', 'room_type'])
gb['price'].mean()

neighbourhood_group  room_type
Bronx                Entire home/apt    138.004819
                     Private room        68.419668
                     Shared room         66.391304
Brooklyn             Entire home/apt    171.587687
                     Hotel room         147.300000
                     Private room        71.291189
                     Shared room         57.870091
Manhattan            Entire home/apt    231.335572
                     Hotel room         292.515670
                     Private room       128.277069
                     Shared room        111.735084
Queens               Entire home/apt    150.168900
                     Hotel room         139.058824
                     Private room        69.972564
                     Shared room         89.891892
Staten Island        Entire home/apt    151.720930
                     Private room        70.312883
                     Shared room         46.000000
Name: price, dtype: float64

In [34]:
# 5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices 
# for each room type in each neighbourhood_group.
gb = df.groupby(['neighbourhood_group', 'room_type'])
gb['price'].agg(['count', 'min', 'max', 'mean', 'median', 'std'])

                                     count  min    max        mean  median  \
neighbourhood_group room_type
Bronx               Entire home/apt    415   25   1404  138.004819   103.0
                    Private room       722   16    700   68.419668    55.0
                    Shared room         46   20    800   66.391304    44.0
Brooklyn            Entire home/apt   9112   20  10000  171.587687   135.0
                    Hotel room          30    0    399  147.300000   129.0
                    Private room      9159   10   2500   71.291189    60.0
                    Shared room        331   15   1500   57.870091    36.0
Manhattan           Entire home/apt  12209    0  10000  231.335572   165.0
                    Hotel room         351    0   2211  292.515670   210.0
                    Private room      7601   10  10000  128.277069    80.0
                    Shared room        419   10  10000  111.735084    60.0
Queens              Entire home/apt   2090   10  10000  150.168900   115.0
                    Hotel room          17    0    249  139.058824   149.0
                    Private room      3499   18   9000   69.972564    55.0
                    Shared room        185   14   3000   89.891892    40.0
Staten Island       Entire home/apt    172   39   1200  151.720930   111.0
                    Private room       163   20    800   70.312883    55.0
                    Shared room          6   19     82   46.000000    38.0

                                            std
neighbourhood_group room_type
Bronx               Entire home/apt  126.032106
                    Private room      57.337866
                    Shared room      114.442703
Brooklyn            Entire home/apt  236.732843
                    Hotel room        91.153206
                    Private room      69.023165
                    Shared room       92.217618
Manhattan           Entire home/apt  410.306439
                    Hotel room       315.924085
                    Private room     448.677306
                    Shared room      502.728868
Queens              Entire home/apt  252.606739
                    Hotel room        50.743806
                    Private room     163.814468
                    Shared room      275.675158
Staten Island       Entire home/apt  147.518392
                    Private room      70.759593
                    Shared room       28.446441

# Load, Merge, and Export files.
1. Load the `prices.csv` and the `n_listings.csv`
    * Having an error..? Inspect the actual csv file if you're having trouble

2. Do join that keeps all the records for each table.
    * Neighbourhood groups should include ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island',
       'LongIsland']

       
3. Save your joined csv as `joined.csv` into the data folder. 


4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.

In [35]:
# 1. Load the `prices.csv` and the `n_listings.csv`
df_prices = pd.read_csv('data/prices.csv')
df_listings = pd.read_csv('data/n_listings.csv', sep=";")

In [36]:
# 2. Do join that keeps all the records for each table.
df_joined = pd.merge(df_prices, df_listings, on="neighbourhood_group", how='outer')
df_joined

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479      1183.0
1            Brooklyn   120.225258     18632.0
2          LongIsland          NaN      4121.0
3           Manhattan   191.880466     20580.0
4              Queens    99.754965         NaN
5       Staten Island   110.947214         NaN

In [37]:
# 3. Save your joined csv as `joined.csv` into the data folder. 
file_path = 'data/joined.csv'
df_joined.to_csv(file_path, index=False)

In [38]:
# 4. Load your newly saved file, see if it looks the same.  If not, try saving with argument `index=False`
new_df_joined = pd.read_csv(file_path)
new_df_joined

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479      1183.0
1            Brooklyn   120.225258     18632.0
2          LongIsland          NaN      4121.0
3           Manhattan   191.880466     20580.0
4              Queens    99.754965         NaN
5       Staten Island   110.947214         NaN

# Extra Credit
Every question below this cell is extra credit and optional.

### 1. (Easy) Explore this new PandasAI Package and tell me what its all about because I've never used it. 
* https://www.youtube.com/watch?v=5w6eZaoDVVk&ab_channel=CodingIsFun  
* See if you can use it on the listings.csv to find out some cool info. or answer some of the questions above.

### 2. (Very Easy) Find other cool Panda packages / add ons and show us what they can do well. And how you installed them.

### 3. (Medium) Use the grammys.csv data for the next section of questions.

1. Who was won Album of the Year in 2016?


2. Who won Best Rap Album in 2009?


3. How many awards was Kendrick Lamar nomiated for, and how many did he win...?

### (Hard) Load the Game Logs for 2022 and add the column names using a dictionary.  
* [Link to the data page](https://www.retrosheet.org/gamelogs/)
* [Link to the column names](https://procatinator.com/)
* haha, gotta find them yourself!

### (Extra Hard) Download the files for the past 5 years into a new folder and add them all into one data frame using pandas, then save that new file.
* Try to not hard code in the file names. We want to do this programmatically because what if we want to add new/more file names in the future.